In [6]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1,-3,4,6],index=['a','b','c','e'])
s

a    1
b   -3
c    4
e    6
dtype: int64

In [5]:
d=pd.Series({'mon':1,'tue':0})
d

mon    1
tue    0
dtype: int64

In [11]:
s0= pd.Series(np.random.randint(10,20,10),index=np.arange(1,11))
s0

1     19
2     11
3     13
4     15
5     14
6     14
7     11
8     13
9     10
10    13
dtype: int32

In [18]:
data ={'country':['Yemen','Eygpt','Soudi'],
      'Capitl':['Sanaa','Cario','Al Ryad']}
df=pd.DataFrame(data,columns=['country','Capitl'])
df

  country   Capitl
0   Yemen    Sanaa
1   Eygpt    Cario
2   Soudi  Al Ryad

In [24]:
df_excel=pd.read_excel('pandas.xlsx')
df_excel

       الاسم  المجموع
0       صالح       70
1       بسام       80
2  عبدالرحمن       90
3       كمال       70
4        حسن       40
5       وئام       90

In [25]:
df_excel.shape

(6, 2)

In [26]:
df_excel.index

RangeIndex(start=0, stop=6, step=1)

In [27]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   الاسم    6 non-null      object
 1   المجموع  6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [28]:
df_excel.head()

       الاسم  المجموع
0       صالح       70
1       بسام       80
2  عبدالرحمن       90
3       كمال       70
4        حسن       40

In [32]:
df_excel.columns

Index(['الاسم', 'المجموع'], dtype='object')

In [33]:
df_excel.tail()

       الاسم  المجموع
1       بسام       80
2  عبدالرحمن       90
3       كمال       70
4        حسن       40
5       وئام       90

In [34]:
df_excel.count()

الاسم      6
المجموع    6
dtype: int64

In [36]:
s

a    1
b   -3
c    4
e    6
dtype: int64

In [37]:
df

  country   Capitl
0   Yemen    Sanaa
1   Eygpt    Cario
2   Soudi  Al Ryad

In [38]:
s['c']

4

In [45]:
df[1:2]

  country Capitl
1   Eygpt  Cario

In [57]:
df.loc[[1],['country']]

  country
1   Eygpt

In [48]:
df_excel.describe()

         المجموع
count   6.000000
mean   73.333333
std    18.618987
min    40.000000
25%    70.000000
50%    75.000000
75%    87.500000
max    90.000000

In [59]:
fd=df_excel.loc[:,['المجموع']]

In [54]:
fd.min()

المجموع    40
dtype: int64

In [49]:
df_excel

       الاسم  المجموع
0       صالح       70
1       بسام       80
2  عبدالرحمن       90
3       كمال       70
4        حسن       40
5       وئام       90